src/Documents/Контракт/Контракт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Контракт</name>
  <comment>Контракты, договоры, коммерческие предложения</comment>
  <registerRecords>InformationRegister.КонтрактыСЗаказчикомПоЗаявкам</registerRecords>
  <registerRecords>InformationRegister.ЦеныПредметовСнабжения</registerRecords>
  <registerRecords>InformationRegister.ТКПСЗаказчикомПоЗаявкам</registerRecords>
  <registerRecords>InformationRegister.ЦеныДЗО</registerRecords>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТоргов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияКП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦеныПредметовСнабжения/ЦеныПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПредметовСнабжения</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКонтрактов</types>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦены</name>
    <type>
      <types>EnumRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЦеныДЗО/ЦеныДЗО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныДЗО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КонтрактыСЗаказчикомПоЗаявкам/КонтрактыСЗаказчикомПоЗаявкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрактыСЗаказчикомПоЗаявкам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ТКПСЗаказчикомПоЗаявкам/ТКПСЗаказчикомПоЗаявкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТКПСЗаказчикомПоЗаявкам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыКонтрактов/ТипыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрактов</name>
  <enumValues>
    <name>Контракт</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>ТКП</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыКонтрактов/ВидыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрактов</name>
  <enumValues>
    <name>КонтрактСЗаказчиком</name>
  </enumValues>
  <enumValues>
    <name>КонтрактСПоставщиком</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыЦен/ТипыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЦен</name>
  <enumValues>
    <name>Внутренняя</name>
  </enumValues>
  <enumValues>
    <name>Внешняя</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Контракт/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	МСтрок = ПредметыСнабжения.НайтиСтроки(Новый Структура("UID","                                    "));
	
	Для каждого Строка Из МСтрок Цикл
		
		Строка.UID = Новый УникальныйИдентификатор;
		
	КонецЦикла;
	
	Если Тип = Перечисления.ТипыКонтрактов.КоммерческоеПредложение Тогда
		
		Для Каждого стрПС Из ПредметыСнабжения Цикл
			Если Не ЗначениеЗаполнено(стрПС.ПредметСнабженияИсходный) Тогда
				стрПС.ПредметСнабженияИсходный = стрПС.ПредметСнабжения;
			КонецЕсли;
			Если стрПС.ПредметСнабжения <> стрПС.ПредметСнабженияИсходный И Не ЗначениеЗаполнено(стрПС.Комментарий) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните комментарий в строке № " + стрПС.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры	//ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИсправитьЗаявки();	
	
	Если Не ПроверитьСоответствиеДанныхЗаявкам() Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	СформироватьДвиженияЦеныПредметовСнабжения();
		
	Если Тип = Перечисления.ТипыКонтрактов.Контракт Тогда
	
		Если Вид = Перечисления.ВидыКонтрактов.КонтрактСЗаказчиком Тогда
		
			СформироватьДвиженияКонтрактыСЗаказчикомПоЗаявкам();	
		
		КонецЕсли;
		
	ИначеЕсли Тип = Перечисления.ТипыКонтрактов.КоммерческоеПредложение Тогда
		
		СформироватьДвиженияЦеныДЗО();		
		
	ИначеЕсли Тип = Перечисления.ТипыКонтрактов.ТКП Тогда
		
		СформироватьДвиженияТКПСЗаказчикомПоЗаявкам();		
	
	КонецЕсли;	
	
КонецПроцедуры	//ОбработкаПроведения

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПроверитьСоответствиеДанныхЗаявкам()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтрактПредметыСнабжения.Заявка КАК Заявка,
	|	КонтрактПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|	КонтрактПредметыСнабжения.Количество КАК Количество
	|ПОМЕСТИТЬ втТабличнаяЧасть
	|ИЗ
	|	Документ.Контракт.ПредметыСнабжения КАК КонтрактПредметыСнабжения
	|ГДЕ
	|	КонтрактПредметыСнабжения.Ссылка = &Ссылка
	|	И НЕ КонтрактПредметыСнабжения.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заявка,
	|	ПредметСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТабличнаяЧасть.Заявка КАК Заявка,
	|	втТабличнаяЧасть.ПредметСнабжения КАК ПредметСнабжения,
	|	СУММА(втТабличнаяЧасть.Количество) КАК КоличествоКонтракт,
	|	СУММА(ЕСТЬNULL(ЗаявкаСпецификация.Количество, 0)) КАК КоличествоЗаявка
	|ИЗ
	|	втТабличнаяЧасть КАК втТабличнаяЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.Спецификация КАК ЗаявкаСпецификация
	|		ПО втТабличнаяЧасть.Заявка = ЗаявкаСпецификация.Ссылка
	|			И втТабличнаяЧасть.ПредметСнабжения = ЗаявкаСпецификация.ПредметСнабжения
	|
	|СГРУППИРОВАТЬ ПО
	|	втТабличнаяЧасть.Заявка,
	|	втТабличнаяЧасть.ПредметСнабжения
	|
	|ИМЕЮЩИЕ
	|	НЕ СУММА(втТабличнаяЧасть.Количество) = СУММА(ЕСТЬNULL(ЗаявкаСпецификация.Количество, 0))";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сообщить("Количество предметов снабжения " + Строка(Выборка.ПредметСнабжения) + " (" + Строка(Выборка.КоличествоКонтракт) + ") не соответствует таковому в документе " +
			Строка(Выборка.Заявка) + " (" + Строка(Выборка.КоличествоЗаявка) + ")", СтатусСообщения.Внимание);
			
	КонецЦикла;
		
	Возврат Ложь;	
	
КонецФункции 	//ПроверитьСоответствиеДанныхЗаявкам

Процедура ИсправитьЗаявки()

	Если Тип = Перечисления.ТипыКонтрактов.КоммерческоеПредложение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтрактПредметыСнабжения.Заявка КАК Заявка,
		|	КонтрактПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
		|	КонтрактПредметыСнабжения.Количество КАК Количество,
		|	КонтрактПредметыСнабжения.ПредметСнабженияИсходный КАК ПредметСнабженияИсходный,
		|	КонтрактПредметыСнабжения.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ втТабличнаяЧасть
		|ИЗ
		|	Документ.Контракт.ПредметыСнабжения КАК КонтрактПредметыСнабжения
		|ГДЕ
		|	КонтрактПредметыСнабжения.Ссылка = &Ссылка
		|	И НЕ КонтрактПредметыСнабжения.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|	И КонтрактПредметыСнабжения.ПредметСнабженияИсходный <> КонтрактПредметыСнабжения.ПредметСнабжения
		|	И КонтрактПредметыСнабжения.ПредметСнабженияИсходный <> ЗНАЧЕНИЕ(Справочник.КаталогПредметовСнабжения.ПустаяСсылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заявка,
		|	ПредметСнабжения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТабличнаяЧасть.Заявка КАК Заявка,
		|	втТабличнаяЧасть.ПредметСнабжения КАК ПредметСнабжения,
		|	СУММА(втТабличнаяЧасть.Количество) КАК КоличествоКонтракт,
		|	СУММА(ЕСТЬNULL(ЗаявкаСпецификация.Количество, 0)) КАК КоличествоЗаявка,
		|	втТабличнаяЧасть.ПредметСнабженияИсходный КАК ПредметСнабженияИсходный,
		|	втТабличнаяЧасть.Комментарий КАК Комментарий
		|ИЗ
		|	втТабличнаяЧасть КАК втТабличнаяЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.Спецификация КАК ЗаявкаСпецификация
		|		ПО втТабличнаяЧасть.Заявка = ЗаявкаСпецификация.Ссылка
		|			И втТабличнаяЧасть.ПредметСнабжения = ЗаявкаСпецификация.ПредметСнабжения
		|
		|СГРУППИРОВАТЬ ПО
		|	втТабличнаяЧасть.Заявка,
		|	втТабличнаяЧасть.ПредметСнабжения,
		|	втТабличнаяЧасть.ПредметСнабженияИсходный,
		|	втТабличнаяЧасть.Комментарий
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(втТабличнаяЧасть.Количество) = СУММА(ЕСТЬNULL(ЗаявкаСпецификация.Количество, 0))";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
		
			ТаблицаРезультат = РезультатЗапроса.Выгрузить();
			
			ТаблицаЗаявок = ТаблицаРезультат.Скопировать();
			ТаблицаЗаявок.Свернуть("Заявка");
			
			Для Каждого  текЗаявка Из ТаблицаЗаявок Цикл
				
				ЗаявкаОбъект = текЗаявка.Заявка.ПолучитьОбъект();
				
				ПСКонтракт = ТаблицаРезультат.НайтиСтроки(Новый Структура("Заявка", текЗаявка.Заявка));
				
				Для Каждого кПредмет Из ПСКонтракт Цикл
					
					ПредметыВзаявке = ЗаявкаОбъект.Спецификация.НайтиСтроки(Новый Структура("ПредметСнабжения", кПредмет.ПредметСнабженияИсходный)); 	
					
					Для Каждого зПредмет Из ПредметыВзаявке Цикл
						
						зПредмет.ПредметСнабжения 			= кПредмет.ПредметСнабжения;
						зПредмет.ПредметСнабженияИсходный 	= кПредмет.ПредметСнабженияИсходный;
						зПредмет.Комментарий 				= кПредмет.Комментарий;
						
					КонецЦикла;
					
				КонецЦикла;
				
				ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 	//ИсправитьЗаявки

#Область ФормированиеДвижений

Процедура СформироватьДвиженияЦеныПредметовСнабжения()
	
	УсловиеПоставки = "";

	Если Вид = Перечисления.ВидыКонтрактов.КонтрактСЗаказчиком И Тип = Перечисления.ТипыКонтрактов.Контракт Тогда
	
		ТипЦены = Перечисления.ТипыЦен.Внешняя;
	
	ИначеЕсли Вид = Перечисления.ВидыКонтрактов.КонтрактСПоставщиком И 
			(Тип = Перечисления.ТипыКонтрактов.Контракт ИЛИ Тип = Перечисления.ТипыКонтрактов.КоммерческоеПредложение ИЛИ Тип = Перечисления.ТипыКонтрактов.Договор) Тогда
	
		ТипЦены = Перечисления.ТипыЦен.Внутренняя;
		
	Иначе
		
		Возврат;
	
	КонецЕсли;
	
	Для каждого Строка Из ПредметыСнабжения Цикл
	
		НоваяСтрока = Движения.ЦеныПредметовСнабжения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Период 		= Дата;
		НоваяСтрока.ТипЦены 	= ТипЦены;
		НоваяСтрока.Контрагент 	= Контрагент;
		НоваяСтрока.Валюта 		= Валюта;
		НоваяСтрока.Статус 		= Статус;
		
		Если Вид = Перечисления.ВидыКонтрактов.КонтрактСЗаказчиком И Тип = Перечисления.ТипыКонтрактов.Контракт Тогда
			
			НоваяСтрока.УсловиеПоставки = Строка.Заявка.ЗапросТКПRFP.УсловияПоставки;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Движения.ЦеныПредметовСнабжения.Записывать = Истина;	

КонецПроцедуры // СформироватьДвиженияЦеныПредметовСнабжения()

Процедура СформироватьДвиженияЦеныДЗО()

	Для каждого Строка Из ПредметыСнабжения Цикл
		
		Если ЗначениеЗаполнено(Строка.Заявка) Тогда
			
			НоваяСтрока = Движения.ЦеныДЗО.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Валюта = Валюта;	
			
		КонецЕсли;	
	
	КонецЦикла;
	
	Движения.ЦеныДЗО.Записывать = Движения.ЦеныДЗО.Количество() > 0;	

КонецПроцедуры //СформироватьДвиженияЦеныДЗО

Процедура СформироватьДвиженияКонтрактыСЗаказчикомПоЗаявкам()

	Для каждого Строка Из ПредметыСнабжения Цикл
		
		Если ЗначениеЗаполнено(Строка.Заявка) Тогда
		
			НоваяСтрока = Движения.КонтрактыСЗаказчикомПоЗаявкам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		КонецЕсли;
	
	КонецЦикла;
	
	Движения.КонтрактыСЗаказчикомПоЗаявкам.Записывать = Движения.КонтрактыСЗаказчикомПоЗаявкам.Количество() > 0;	

КонецПроцедуры  //СформироватьДвиженияКонтрактыСЗаказчикомПоЗаявкам

Процедура СформироватьДвиженияТКПСЗаказчикомПоЗаявкам()

	Для каждого Строка Из ПредметыСнабжения Цикл
		
		Если ЗначениеЗаполнено(Строка.Заявка) Тогда
		
			НоваяСтрока = Движения.ТКПСЗаказчикомПоЗаявкам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		КонецЕсли;
	
	КонецЦикла;
	
	Движения.ТКПСЗаказчикомПоЗаявкам.Записывать = Движения.ТКПСЗаказчикомПоЗаявкам.Количество() > 0;	

КонецПроцедуры  //СформироватьДвиженияТКПСЗаказчикомПоЗаявкам

#КонецОбласти
